asrulmunir/bidin-firmware/sdkconfig.defaults
# Bidin Firmware - SDK Configuration Defaults
# Minimal build for ESP32-S3 Voice Assistant

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash configuration (match your 16MB chip)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_LWIP_IPV6=n

# HTTP Client (enable WebSocket support)
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Minimal build options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# Disable unused components
CONFIG_BT_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_BT_BR_EDR=n
CONFIG_BT_BLE=n
CONFIG_MBEDTLS_SSL_PROTO_DTLS=n
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=n
